# !/bin/bash
cd /home/studs/s466140/lab0
wc -l magmortar0/* 2>/dev/null | grep -v 'total' >/tmp/line_counts.txt # Подсчитать количество строк содержимого файлов в директории magmortar0, результат записать в файл в директории /tmp, подавить вывод ошибок доступа
# Вывести четыре последних элемента рекурсивного списка имен и атрибутов файлов в директории lab0, содержащих строку "ru", список отсортировать по имени z->a, подавить вывод ошибок доступа
grep -i "po" houndoom1/* 2>/dev/null                                                                       # Вывести содержимое файлов в директории houndoom1, оставить только строки, содержащие "po", регистр символов игнорировать, подавить вывод ошибок доступа
ls -l archeops4 2>&1 | sort -k2,2nr                                                                        # Вывести список имен и атрибутов файлов в директории archeops4, список отсортировать по убыванию количества жестких ссылок, добавить вывод ошибок доступа в стандартный поток вывода
wc -m pineco gallade gengar cyndaquil arbok darmanitan lickitung samurott donphan whirlpede 2>&1 | sort -n # Подсчитать количествnо символов содержимого файлов: pineco, gallade, gengar, cyndaquil, arbok, darmanitan, lickitung, samurott, donphan, whirlpede, отсортировать вывод по увеличению количества, добавить вывод ошибок доступа в стандартный поток вывода
Вывести четыре последних элемента рекурсивного списка имен и атрибутов файлов в директории lab0, начинающихся на символ 'm', список отсортировать по убыванию даты изменения записи о файле, ошибки доступа не подавлять и не перенаправлять
Вывести рекурсивно список имен и атрибутов файлов в директории lab0, содержащих строку "tu", список отсортировать по убыванию даты доступа к файлу, ошибки доступа не подавлять и не перенаправлять
Рекурсивно вывести содержимое файлов с номерами строк из директории lab0, имя которых заканчивается на 'w', строки отсортировать по имени z- добавить вывод ошибок доступа в стандартный поток вывода >a,
Вывести рекурсивно список имен и атрибутов файлов в директории lab0, начинающихся на символ 'd', список отсортировать по убыванию количества жестких ссылок, ошибки доступа не подавлять и не перенаправлять
Вывести рекурсивно список имен и атрибутов файлов в директории lab0, содержащих строку "un", список отсортировать по возрастанию даты изменения записи о файле, ошибки доступа перенаправить в файл в директории /tmp
Вывести три последних элемента рекурсивного списка имен и атрибутов файлов в директории lab0, заканчивающихся на символ 't', список отсортировать по убыванию даты модификации файла, ошибки доступа не подавлять и не перенаправлять
Вывести содержимое файлов: camerupt, weezing, torchic, dustox, hippowdon, pineco, gallade, gengar, cyndaquil, arbok с номерами строк, исключить строки, содержащие "Ven", ошибки доступа перенаправить в файл в директории /tmp
Вывести содержимое файла chandelure6, исключить строки, заканчивающиеся на 'y', ошибки доступа не подавлять и не перенаправлять
Рекурсивно вывести содержимое файлов с номерами строк из директории lab0, имя которых начинается на 'b', строки отсортировать по имени a- подавить вывод ошибок доступа >z,
Вывести содержимое файлов: magmortar, houndoom, wailmer, shelmet, onix с номерами строк, исключить строки, содержащие "ght", регистр символов игнорировать, подавить вывод ошибок доступа
Вывести содержимое файлов с номерами строк в директории archeops4, исключить строки, заканчивающиеся на 'E', регистр символов игнорировать, добавить вывод ошибок доступа в стандартный поток вывода
Вывести два первых элемента рекурсивного списка имен и атрибутов файлов в директории lab0, заканчивающихся на символ 'h', список отсортировать по убыванию количества жестких ссылок, ошибки доступа перенаправить в файл в директории /tmp
Вывести содержимое файлов в директории houndoom1, строки отсортировать по имени a- подавить вывод ошибок доступа >z,
